Revit 2027 API
BuiltInFailures.GeneralFailures.ParameterValueNotInRange Property
 The value for [Parameter Name] must be between [Value] and [Value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ParameterValueNotInRange { get; }
Public Shared ReadOnly Property ParameterValueNotInRange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ParameterValueNotInRange {
	FailureDefinitionId^ get ();
}
static member ParameterValueNotInRange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace